app/Http/Controllers/Auth/LoginController.php

select * from `users` where `email` = 'lorena90@example.net' and `users`.`deleted_at` is null limit 1
select * from `users` where `email` = 'lorena90@example.net' and `password` = 'y$/roIvReYE4cQcB/TlE8XjOLTCn1r5hmBSYJ/6Orz6jDj4dLnOK/S2' and `users`.`deleted_at` is null limit 1
---
    protected function sendFailedLoginResponse(Request $request)
    {
        if ( ! User::where('email', $request->email)->first() ) {
            return redirect()->back()
                             ->withInput($request->only($this->username(), 'remember'))
                             ->withErrors([$this->username() => 'Correo o contraseña incorrecta']);
        }

        if ( ! User::where('email', $request->email)->where('password', bcrypt($request->password))->first() ) {