app/Models/Users/User.php

    public function listStudents()
    {
        return $this->leftJoin('plan_user', 'plan_user.user_id', 'users.id')
                    ->with(['todayPlan' => function ($todayPlan) {
                        $todayPlan->with(['plan:id,plan'])
                            ->select(
                                'id',
                                'user_id',
                                'plan_id',
                                'start_date',
                                'finish_date',
                                'counter',
                                'plan_status_id'
                            );
                    }])
                    ->distinct()
                    ->get([
                        'users.id', 'users.rut', 'users.first_name', 'users.last_name',
                        'users.email', 'users.avatar', 'users.status_user_id'
                    ]);
---
select `id`, `plan_id` from `plan_user` where `plan_user`.`id` in (13, 14, 18, 191, 394, 776, 1002, 1367) and `plan_user`.`deleted_at` is null
select `id`, `plan` from `plans` where `plans`.`id` in (1, 2, 3, 11)