app/Http/Controllers/Settings/DensityParameterController.php

select * from `density_parameters` order by `id` desc
---
    public function clasesDensities()
    {
        $densities = DensityParameter::orderByDesc('id')->get();