app/Http/Controllers/Users/UserController.php

select count(*) as total, status_user_id from `users` where `users`.`deleted_at` is null group by `status_user_id`
---
    public function index()
    {
        $status_users = User::CountStatusUsers()->get();