app/Http/Controllers/HomeController.php

    public function expiredNext()
    {
        $plan_users = PlanUser::where('plan_status_id', 1)
            ->where('finish_date', '>=', now())
            ->orderBy('finish_date')
            ->take(10)
            ->get();

        return $plan_users->map(function ($plan) {
            return [
                'user_id' => isset($plan->user) ? $plan->user->id : '',
                'alumno' => isset($plan->user) ? $plan->user->first_name . ' ' . $plan->user->last_name : '',
                'plan' => isset($plan->plan) ? $plan->plan->plan : '',
                'fecha_termino' => Carbon::parse($plan->finish_date)->diffForHumans(),
                'telefono' => isset($plan->user) ? $plan->user->phone : '',
            ];
---
select * from `plan_user` where `plan_status_id` = 1 and `finish_date` >= '2019-09-30 12:51:06' and `plan_user`.`deleted_at` is null order by `finish_date` asc limit 10
select * from `plans` where `plans`.`id` = 1 limit 1
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1

    public function incomessummary()
    {
        //obtener todos los planes del mes actual que tengan anexada una boleta
        //sin contar boletas eliminadas
        $mes['periodo'] = 'mensual';
        $month_amount = Bill::whereDate('bills.date', '>=', today()->startOfMonth())
                            ->whereDate('bills.date', '<=', today()->endOfMonth())
                            ->get()
                            ->sum('amount');
        $mes['ingresos'] = '$ ' . number_format($month_amount, $decimal = 0, '.', '.');
        $mes['cantidad'] = Bill::whereDate('bills.date', '>=', today()->startOfMonth())
            ->whereDate('bills.date', '<=', today()->endOfMonth())
            ->count();
---
select * from `bills` where date(`bills`.`date`) = '2019-09-30' and `bills`.`deleted_at` is null
select count(*) as aggregate from `bills` where date(`bills`.`date`) = '2019-09-30' and `bills`.`deleted_at` is null